Hi @albertleao - I am unable to recreate this, do you still have an issue?

```
Terraform v1.11.4
on linux_amd64
+ provider registry.terraform.io/hashicorp/aws v5.95.0

-

Terraform will perform the following actions:

  # aws_connect_contact_flow_module.myl_module will be created
  + resource "aws_connect_contact_flow_module" "myl_module" {
      + arn                    = (known after apply)
      + contact_flow_module_id = (known after apply)
      + content                = (known after apply)
      + content_hash           = "i+pg6z/EYeR1qHEiTMx/UmgPfJp4x6q2KlX4qDZjonA="
      + description            = "My new module description"
      + filename               = "templates/flows/modules/voice.json"
      + id                     = (known after apply)
      + instance_id            = "00000000-0000-0000-0000-000000000000"
      + name                   = "My new module"
      + tags                   = {
          + "Application" = "Terraform"
          + "Method"      = "Create"
          + "Name"        = "My new module."
        }
      + tags_all               = {
          + "Application" = "Terraform"
          + "Method"      = "Create"
          + "Name"        = "My new module."
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

aws_connect_contact_flow_module.myl_module: Creating...
aws_connect_contact_flow_module.myl_module: Creation complete after 1s [id=00000000-0000-0000-0000-000000000000:00000000-0000-0000-0000-000000000000]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
```

I took a look at CloudTrail after the apply and can see the create followed by the describe.

The describe call has just the UUID, not the ARN:

```
    "requestParameters": {
        "InstanceId": "00000000-0000-0000-0000-000000000000",
        "ContactFlowModuleId": "00000000-0000-0000-0000-000000000000"
    },
```

Given your CloudTrail output above, I suspect the ARN is url escaped when it reaches the split that you referenced.

`%3A` is url escaped `:` and therefore the split wouldn't be able to pluck out the ID.

Let me know if you still have the issue.